espressif/esp-idf/components/soc/esp32/register/soc/sdio_slc_struct.h
            uint32_t reserved10:       22;
        };
        uint32_t val;
    } slc0_dscr_rec_conf;
    union {
        struct {
            uint32_t dat0_crc_err_cnt: 8;
            uint32_t dat1_crc_err_cnt: 8;
            uint32_t dat2_crc_err_cnt: 8;
            uint32_t dat3_crc_err_cnt: 8;
        };
        uint32_t val;
    } sdio_crc_st0;
    union {
        struct {
            uint32_t cmd_crc_err_cnt: 8;
            uint32_t reserved8:      23;
            uint32_t err_cnt_clr:     1;
        };
        uint32_t val;
    } sdio_crc_st1;
    uint32_t slc0_eof_start_des;                           /**/
    uint32_t slc0_push_dscr_addr;                          /**/
    uint32_t slc0_done_dscr_addr;                          /**/
    uint32_t slc0_sub_start_des;                           /**/
    union {
        struct {
            uint32_t rx_dscr_cnt_lat:  10;
            uint32_t reserved10:        6;
            uint32_t rx_get_eof_occ:    1;
            uint32_t reserved17:       15;
        };
        uint32_t val;
    } slc0_dscr_cnt;
    union {
        struct {
            uint32_t len_lim:   20;
            uint32_t reserved20:12;
        };
        uint32_t val;
    } slc0_len_lim_conf;
    union {
        struct {
            uint32_t frhost_bit01:            1;
            uint32_t frhost_bit11:            1;
            uint32_t frhost_bit21:            1;
            uint32_t frhost_bit31:            1;
            uint32_t frhost_bit41:            1;
            uint32_t frhost_bit51:            1;
            uint32_t frhost_bit61:            1;
            uint32_t frhost_bit71:            1;
            uint32_t rx_start1:               1;
            uint32_t tx_start1:               1;
            uint32_t rx_udf1:                 1;
            uint32_t tx_ovf1:                 1;
            uint32_t token0_1to01:            1;
            uint32_t token1_1to01:            1;
            uint32_t tx_done1:                1;
            uint32_t tx_suc_eof1:             1;
            uint32_t rx_done1:                1;
            uint32_t rx_eof1:                 1;
            uint32_t tohost1:                 1;
            uint32_t tx_dscr_err1:            1;
            uint32_t rx_dscr_err1:            1;
            uint32_t tx_dscr_empty1:          1;
            uint32_t host_rd_ack1:            1;
            uint32_t wr_retry_done1:          1;
            uint32_t tx_err_eof1:             1;
            uint32_t cmd_dtc1:                1;
            uint32_t rx_quick_eof1:           1;
            uint32_t reserved27:              5;
        };
        uint32_t val;
    } slc0_int_st1;
    union {
        struct {
            uint32_t frhost_bit01:             1;
            uint32_t frhost_bit11:             1;
            uint32_t frhost_bit21:             1;
            uint32_t frhost_bit31:             1;
            uint32_t frhost_bit41:             1;
            uint32_t frhost_bit51:             1;
            uint32_t frhost_bit61:             1;
            uint32_t frhost_bit71:             1;
            uint32_t rx_start1:                1;
            uint32_t tx_start1:                1;
            uint32_t rx_udf1:                  1;
            uint32_t tx_ovf1:                  1;
            uint32_t token0_1to01:             1;
            uint32_t token1_1to01:             1;
            uint32_t tx_done1:                 1;
            uint32_t tx_suc_eof1:              1;
            uint32_t rx_done1:                 1;
            uint32_t rx_eof1:                  1;
            uint32_t tohost1:                  1;
            uint32_t tx_dscr_err1:             1;
            uint32_t rx_dscr_err1:             1;
            uint32_t tx_dscr_empty1:           1;
            uint32_t host_rd_ack1:             1;
            uint32_t wr_retry_done1:           1;
            uint32_t tx_err_eof1:              1;
            uint32_t cmd_dtc1:                 1;
            uint32_t rx_quick_eof1:            1;
            uint32_t reserved27:               5;
        };
        uint32_t val;
    } slc0_int_ena1;
    union {
        struct {
            uint32_t frhost_bit81:            1;
            uint32_t frhost_bit91:            1;
            uint32_t frhost_bit101:           1;
            uint32_t frhost_bit111:           1;
            uint32_t frhost_bit121:           1;
            uint32_t frhost_bit131:           1;
            uint32_t frhost_bit141:           1;
            uint32_t frhost_bit151:           1;
            uint32_t rx_start1:               1;
            uint32_t tx_start1:               1;
            uint32_t rx_udf1:                 1;
            uint32_t tx_ovf1:                 1;
            uint32_t token0_1to01:            1;
            uint32_t token1_1to01:            1;
            uint32_t tx_done1:                1;
            uint32_t tx_suc_eof1:             1;
            uint32_t rx_done1:                1;
            uint32_t rx_eof1:                 1;
            uint32_t tohost1:                 1;
            uint32_t tx_dscr_err1:            1;
            uint32_t rx_dscr_err1:            1;
            uint32_t tx_dscr_empty1:          1;
            uint32_t host_rd_ack1:            1;
            uint32_t wr_retry_done1:          1;
            uint32_t tx_err_eof1:             1;
            uint32_t reserved25:              7;
        };
        uint32_t val;
    } slc1_int_st1;
    union {
        struct {
            uint32_t frhost_bit81:             1;
            uint32_t frhost_bit91:             1;
            uint32_t frhost_bit101:            1;
            uint32_t frhost_bit111:            1;
            uint32_t frhost_bit121:            1;
            uint32_t frhost_bit131:            1;
            uint32_t frhost_bit141:            1;
            uint32_t frhost_bit151:            1;
            uint32_t rx_start1:                1;
            uint32_t tx_start1:                1;
            uint32_t rx_udf1:                  1;
            uint32_t tx_ovf1:                  1;
            uint32_t token0_1to01:             1;
            uint32_t token1_1to01:             1;
            uint32_t tx_done1:                 1;
            uint32_t tx_suc_eof1:              1;
            uint32_t rx_done1:                 1;
            uint32_t rx_eof1:                  1;
            uint32_t tohost1:                  1;
            uint32_t tx_dscr_err1:             1;
            uint32_t rx_dscr_err1:             1;
            uint32_t tx_dscr_empty1:           1;
            uint32_t host_rd_ack1:             1;
            uint32_t wr_retry_done1:           1;
            uint32_t tx_err_eof1:              1;
            uint32_t reserved25:               7;
        };
        uint32_t val;
    } slc1_int_ena1;
    uint32_t reserved_14c;
    uint32_t reserved_150;
    uint32_t reserved_154;
    uint32_t reserved_158;
    uint32_t reserved_15c;
    uint32_t reserved_160;
    uint32_t reserved_164;
    uint32_t reserved_168;
    uint32_t reserved_16c;
    uint32_t reserved_170;
    uint32_t reserved_174;
    uint32_t reserved_178;
    uint32_t reserved_17c;
    uint32_t reserved_180;
    uint32_t reserved_184;
    uint32_t reserved_188;
    uint32_t reserved_18c;
    uint32_t reserved_190;
    uint32_t reserved_194;
    uint32_t reserved_198;
    uint32_t reserved_19c;
    uint32_t reserved_1a0;
    uint32_t reserved_1a4;
    uint32_t reserved_1a8;
    uint32_t reserved_1ac;
    uint32_t reserved_1b0;
    uint32_t reserved_1b4;
    uint32_t reserved_1b8;
    uint32_t reserved_1bc;
    uint32_t reserved_1c0;
    uint32_t reserved_1c4;
    uint32_t reserved_1c8;
    uint32_t reserved_1cc;
    uint32_t reserved_1d0;
    uint32_t reserved_1d4;
    uint32_t reserved_1d8;
    uint32_t reserved_1dc;
    uint32_t reserved_1e0;
    uint32_t reserved_1e4;
    uint32_t reserved_1e8;
    uint32_t reserved_1ec;
    uint32_t reserved_1f0;
    uint32_t reserved_1f4;
    uint32_t date;                                      /**/
    uint32_t id;                                        /**/
} slc_dev_t;
extern slc_dev_t SLC;

#ifdef __cplusplus
}
#endif

#endif  /* _SOC_SLC_STRUCT_H_ */
